<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#20171;&#32461;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><style type="text/css">
body { background-image: url('images/draft.png');
       background-repeat: no-repeat;
       background-position: top left;
       /* The following properties make the watermark "fixed" on the page. */
       /* I think that's just a bit too distracting for the reader... */
       /* background-attachment: fixed; */
       /* background-position: center center; */
     }</style><link rel="start" href="index.html" title="Leona"><link rel="up" href="index.html" title="Leona"><link rel="prev" href="preface.html" title="&#24207;&#35328;"><link rel="next" href="technique.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#25216;&#26415;&#36873;&#22411;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns="http://www.w3.org/TR/xhtml1/transitional" xmlns:fo="http://www.w3.org/1999/XSL/Format" style="background-color:white;border:none;height:73px;border:1px solid black;"><a style="border:none;" href="http://www.family168.com/" title="Family168"><img src="images/family168.png" border="0"></img></a></div><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#20171;&#32461;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preface.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="technique.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="chapter" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title"><a name="introduce"></a>&#31532;&nbsp;1&nbsp;&#31456;&nbsp;&#20171;&#32461;</h2></div></div></div><div class="sect1" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d4e40"></a>1.1.&nbsp;&#27010;&#36848;</h2></div></div></div><p>J2EE&#31038;&#21306;&#22312;&#25269;&#21463;&#20102;ROR&#30340;&#24378;&#28872;&#20914;&#20987;&#21518;&#65292;&#25152;&#26377;&#30340;&#21516;&#24535;&#20204;&#37117;&#24320;&#22987;&#24594;&#21564;&#30528;&#25105;&#20204;&#35201;&#26368;&#31616;&#21333;&#30340;&#20840;&#31449;&#24335;&#24320;&#21457;&#26694;&#26550;&#12290;&#21487;&#26159;&#38754;&#23545;Java&#30028;&#36825;&#20040;&#22810;&#26519;&#26519;&#31181;&#31181;&#30340;&#24320;&#28304;&#26694;&#26550;&#65292;&#27809;&#26377;&#20219;&#20309;&#19968;&#20010;&#20154;&#26377;&#37027;&#31181;&#30127;&#21170;&#25243;&#24323;&#24050;&#26377;&#30340;&#25152;&#26377;&#26694;&#26550;&#65292;&#37325;&#26032;&#20877;&#25630;&#19968;&#22871;&#19996;&#35199;&#20986;&#26469;&#65292;&#25152;&#20197;&#25105;&#20204;&#26368;&#32456;&#30475;&#21040;&#30340;&#36824;&#26159;&#19968;&#20010;&#26032;&#29942;&#35013;&#26087;&#37202;&#30340;&#26679;&#23376;&#12290;Spring&#36824;&#26159;&#37027;&#20010;Spring&#65292;Hibernate&#36824;&#26159;&#37027;&#20010;Hibernate&#65292;Struts&#36824;&#26159;&#37027;&#20010;Struts&#12290;</p><p>&#23601;&#36825;&#26679;&#65292;&#25105;&#20204;&#21162;&#21147;&#30340;&#26041;&#21521;&#32456;&#20110;&#20174;&#37039;&#37112;&#23398;&#27493;&#21464;&#25104;&#20102;&#21478;&#36767;&#36426;&#24452;&#65292;&#27605;&#31455;&#21681;&#20204;&#27599;&#22825;&#37117;&#22312;&#21152;&#29677;&#65292;&#27809;&#26102;&#38388;&#30740;&#31350;ROR&#31350;&#31455;&#24590;&#26679;&#35299;&#20915;&#20225;&#19994;&#19994;&#21153;&#27969;&#31243;&#20013;&#30340;&#37027;&#20123;&#22797;&#26434;&#36923;&#36753;&#65292;&#25105;&#20204;&#26368;&#38656;&#35201;&#30340;&#36824;&#26159;&#19968;&#20010;&#21487;&#20197;&#25343;&#26469;&#23601;&#29992;&#30340;&#65292;&#21487;&#20197;&#35299;&#20915;&#22823;&#22810;&#25968;&#38382;&#39064;&#30340;&#65292;&#20063;&#27604;&#36739;&#22909;&#29992;&#30340;&#19968;&#22871;&#26694;&#26550;&#12290;</p><p>&#25105;&#20204;&#25152;&#26399;&#26395;&#30340;&#36825;&#22871;&#26694;&#26550;&#65292;&#26159;&#19968;&#22871;&#25972;&#21512;&#20102;&#35832;&#22810;&#24320;&#28304;&#32452;&#20214;&#30340;&#20840;&#31449;&#24335;&#24179;&#21488;&#65292;&#21253;&#25324;&#20102;WebService, JMS, Workflow, Security, Report, Rule, Search, Timer&#31561;&#20225;&#19994;&#24212;&#29992;&#21487;&#33021;&#29992;&#21040;&#30340;&#29305;&#24615;&#65292;&#24182;&#19988;&#26159;&#20197;&#26500;&#26550;&#24335;&#36827;&#34892;&#24320;&#21457;&#65292;&#37197;&#21512;&#33050;&#26412;&#65292;&#24037;&#20855;&#19982;IDE&#65292;&#26368;&#32456;&#36825;&#32452;&#21512;&#25104;&#19968;&#22871;&#19968;&#31449;&#24335;&#30340;&#24555;&#36895;&#24320;&#21457;&#26694;&#26550;&#12290;</p><p>&#22312;&#36825;&#20010;&#24179;&#21488;&#19978;&#65292;&#25105;&#20204;&#36824;&#35201;&#25552;&#20379;&#23545;&#24212;&#30340;&#23454;&#20363;&#20195;&#30721;&#65292;&#28436;&#31034;&#22312;&#23454;&#38469;&#24320;&#21457;&#20013;&#24635;&#32467;&#20986;&#30340;&#65292;Java&#20225;&#19994;&#39046;&#22495;&#26041;&#38754;&#30340;&#26368;&#20339;&#23454;&#36341;&#12290;</p><p>&#36824;&#38656;&#35201;&#27880;&#24847;&#30340;&#19968;&#28857;&#26159;&#65292;&#36719;&#20214;&#24320;&#21457;&#19981;&#20165;&#20165;&#26159;&#19968;&#20010;&#25216;&#26415;&#38382;&#39064;&#65292;&#20063;&#19982;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#27969;&#31243;&#31649;&#29702;&#65292;&#36136;&#37327;&#31649;&#29702;&#26377;&#30528;&#21315;&#19997;&#19975;&#32533;&#30340;&#32852;&#31995;&#65292;&#25152;&#20197;&#25105;&#20204;&#19981;&#21482;&#35201;&#28436;&#31034;&#25216;&#26415;&#26550;&#26500;&#65292;&#25991;&#26723;&#65292;&#35774;&#35745;&#65292;&#27979;&#35797;&#65292;&#28436;&#31034;&#37117;&#23558;&#21253;&#25324;&#22312;&#25105;&#20204;&#30340;&#30740;&#31350;&#33539;&#22260;&#20869;&#12290;</p></div><div class="sect1" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d4e47"></a>1.2.&nbsp;&#26550;&#26500;</h2></div></div></div><p>&#22312;&#36827;&#34892;J2EE&#30340;&#20225;&#19994;&#24320;&#21457;&#26102;&#65292;&#25105;&#20204;&#24050;&#32463;&#28176;&#28176;&#24320;&#22987;&#20943;&#23569;&#20998;&#23618;&#65292;&#20943;&#23569;&#35774;&#35745;&#65292;&#19981;&#20877;&#36861;&#27714;&#26368;&#23436;&#32654;&#30340;&#35774;&#35745;&#19982;&#26550;&#26500;&#65292;&#32780;&#26159;&#19968;&#20999;&#20197;&#23454;&#38469;&#20026;&#20027;&#35753;&#21681;&#20204;&#30340;&#19996;&#35199;&#20570;&#24471;&#36234;&#24555;&#36234;&#22909;&#65292;&#27605;&#31455;&#32769;&#26495;&#32463;&#24120;&#35828;&#21681;&#20204;&#35201;&#24212;&#20184;&#30340;&#26159;&#28789;&#27963;&#22810;&#21464;&#30340;&#19994;&#21153;&#65292;&#26159;&#19981;&#26029;&#21464;&#21270;&#30340;&#24066;&#22330;&#65292;&#22914;&#26524;&#36319;&#19981;&#19978;&#21464;&#21270;&#30340;&#33050;&#27493;&#23601;&#19981;&#34892;&#20102;&#12290;</p><p>&#36825;&#26679;&#65292;&#25105;&#20204;&#23601;&#38656;&#35201;&#23613;&#37327;&#20943;&#23569;&#23398;&#20064;&#25104;&#26412;&#65292;&#36873;&#25321;&#26368;&#24120;&#29992;&#30340;&#26694;&#26550;&#32452;&#35013;&#25105;&#20204;&#30340;&#24179;&#21488;&#65292;&#25105;&#20204;&#36824;&#38656;&#35201;&#20943;&#23569;&#37197;&#32622;&#21644;&#20195;&#30721;&#65292;&#27605;&#31455;&#25163;&#20889;&#30340;&#36234;&#23569;&#65292;&#29359;&#38169;&#30340;&#26426;&#20250;&#20063;&#23601;&#36234;&#23567;&#12290;&#25105;&#20204;&#36824;&#35201;&#21046;&#23450;&#32534;&#30721;&#35268;&#33539;&#65292;&#21152;&#24378;&#27979;&#35797;&#21644;&#20195;&#30721;&#36136;&#37327;&#26816;&#27979;&#65292;&#20813;&#24471;&#20197;&#21518;&#32500;&#25252;&#12289;&#20462;&#25913;&#30340;&#26102;&#20505;&#20986;&#29616;&#38382;&#39064;&#12290;</p><p>&#37027;&#25105;&#20204;&#24590;&#20040;&#25165;&#33021;&#32534;&#20889;&#26368;&#23569;&#20195;&#30721;&#23601;&#23436;&#25104;CRUD&#21151;&#33021;&#21602;&#65311;</p><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e52"></a>1.2.1.&nbsp;&#26680;&#24515;&#35774;&#35745;</h3></div></div></div><p>&#20197;JDK5&#21644;Spring&#20570;&#26368;&#22522;&#26412;&#30340;&#26550;&#26500;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e55"></a>1.2.2.&nbsp;&#39046;&#22495;&#27169;&#22411;</h3></div></div></div><p>&#39046;&#22495;&#27169;&#22411;&#37319;&#29992;hibernate3&#25903;&#25345;&#30340;jpa&#26041;&#24335;&#23454;&#29616;ORM&#25968;&#25454;&#25345;&#20037;&#21270;&#12290;&#36825;&#26041;&#38754;&#21033;&#29992;&#20102;jdk5&#30340;annotation&#27880;&#35299;&#21644;spring&#25552;&#20379;&#30340;AnnotationSessionFactoryBean&#65292;&#23454;&#29616;&#38646;&#37197;&#32622;&#25991;&#20214;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e58"></a>1.2.3.&nbsp;Manager&#23618;</h3></div></div></div><p>&#26381;&#21153;&#23618;&#19981;&#20351;&#29992;&#25509;&#21475;&#65292;&#20063;&#30465;&#30053;DAO&#23618;&#65292;&#35753;Manager&#30452;&#25509;&#32487;&#25215;&#23553;&#35013;&#22909;&#30340;&#36229;&#31867;&#65292;&#20381;&#38752;&#27867;&#22411;&#33719;&#24471;&#23545;&#24212;&#39046;&#22495;&#27169;&#22411;&#30340;&#21508;&#31181;&#21151;&#33021;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e61"></a>1.2.4.&nbsp;Web&#23618;</h3></div></div></div><p>Struts&#37096;&#20998;&#38656;&#35201;&#35268;&#33539;&#19968;&#22871;&#24815;&#29992;&#30340;&#21629;&#21517;&#35268;&#21017;&#65292;&#20415;&#20110;&#35268;&#33539;&#24320;&#21457;&#36807;&#31243;&#21644;&#24320;&#21457;&#32467;&#26500;&#12290;</p><p>&#22240;&#20026;web&#23618;&#30340;&#28789;&#27963;&#24615;&#65292;&#21363;&#20351;&#23553;&#35013;BaseAction&#65292;&#36229;&#31867;&#20013;&#20063;&#19981;&#20250;&#21253;&#21547;&#22826;&#22810;&#36923;&#36753;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e65"></a>1.2.5.&nbsp;View&#23618;</h3></div></div></div><p>&#34920;&#29616;&#23618;&#37096;&#20998;&#26377;&#22810;&#31181;&#36873;&#25321;&#12290;</p><div class="itemizedlist"><ul type="disc"><li><p>JSP-2.0&#26159;&#26368;&#23481;&#26131;&#20837;&#25163;&#30340;&#36884;&#24452;&#65292;&#20294;&#26159;&#21151;&#33021;&#26368;&#24369;&#12290;</p></li><li><p>Freemarker&#21151;&#33021;&#24378;&#21170;&#65292;&#20294;&#26377;&#23398;&#20064;&#38376;&#27099;&#12290;</p></li><li><p>&#36873;&#25321;One Application One Page&#30340;Ajax&#32452;&#20214;&#19982;&#20256;&#32479;&#24320;&#21457;&#26041;&#24335;&#30456;&#24046;&#22826;&#22823;&#65292;&#39118;&#38505;&#22826;&#22823;&#12290;</p></li><li><p>&#31350;&#31455;&#26159;&#36873;&#25321;JSP-2.0&#25110;Freemarker&#65292;&#22806;&#21152;&#19968;&#20123;Ajax&#23567;&#32452;&#20214;&#65292;&#36824;&#26159;&#36873;&#25321;&#20840;&#22871;&#30340;Ajax&#32452;&#20214;&#65292;&#26159;&#20010;&#24456;&#22823;&#30340;&#38382;&#39064;&#12290;</p></li></ul></div></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e77"></a>1.2.6.&nbsp;&#27979;&#35797;</h3></div></div></div><p>&#27979;&#35797;&#37319;&#29992;mock&#23454;&#29616;&#21333;&#20803;&#27979;&#35797;&#65292;&#38598;&#25104;&#27979;&#35797;&#37319;&#29992;selenium&#20808;&#24405;&#21046;&#21518;&#33258;&#21160;&#22238;&#25918;&#30340;&#26041;&#24335;&#65292;&#21151;&#33021;&#27979;&#35797;&#20351;&#29992;Spring-test&#25552;&#20379;&#30340;&#27979;&#35797;&#36229;&#31867;&#21152;&#36733;&#25152;&#26377;xml&#36164;&#28304;&#36827;&#34892;&#27979;&#35797;&#12290;&#32771;&#34385;&#20351;&#29992;jmeter&#36827;&#34892;&#21387;&#21147;&#27979;&#35797;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e80"></a>1.2.7.&nbsp;&#26435;&#38480;&#27169;&#22411;</h3></div></div></div><p>&#37319;&#29992;Spring Security&#65292;&#23454;&#29616;&#22522;&#20110;RBAC&#65288;Role Based Access Control&#22522;&#20110;&#35282;&#33394;&#30340;&#35775;&#38382;&#25511;&#21046;&#65289;&#30340;&#26435;&#38480;&#27169;&#22411;&#31649;&#29702;&#12290;</p><p>Spring Security&#26412;&#36523;&#33258;&#24102;&#22810;&#31181;&#39564;&#35777;&#26041;&#24335;&#65292;&#36825;&#37324;&#20223;&#25928;springside-2.0&#20013;&#30340;security&#27169;&#22359;&#65292;&#23545;&#20854;&#25968;&#25454;&#27169;&#22411;&#36827;&#34892;&#20102;&#25193;&#23637;&#65292;&#36890;&#36807;User&#29992;&#25143; - Role&#35282;&#33394; - Resource&#36164;&#28304;&#19977;&#32773;&#20043;&#38388;&#30340;&#22810;&#23545;&#22810;&#20851;&#31995;&#23454;&#29616;&#26435;&#38480;&#31649;&#29702;&#65292;&#38468;&#21152;Role&#35282;&#33394;&#19982;Menu&#33756;&#21333;&#20043;&#38388;&#30340;&#20851;&#32852;&#65292;&#26085;&#24120;&#35843;&#24230;&#26102;&#65292;&#21482;&#38656;&#35201;&#20026;&#29992;&#25143;&#36873;&#25321;&#35282;&#33394;&#65292;&#23601;&#21487;&#20197;&#33719;&#24471;&#23545;&#24212;&#30340;&#35775;&#38382;&#26435;&#38480;&#12290;</p><p>URL&#36164;&#28304;&#30340;&#35775;&#38382;&#20351;&#29992;filter&#36807;&#28388;&#22120;&#25318;&#25130;&#65292;METHOD&#36164;&#28304;&#30340;&#35775;&#38382;&#20351;&#29992;AOP&#25318;&#25130;&#22120;&#25318;&#25130;&#12290;</p><p>ACL&#65288;Access Control List&#35775;&#38382;&#25511;&#21046;&#21015;&#34920;&#65289;&#23578;&#26410;&#23454;&#29616;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e86"></a>1.2.8.&nbsp;&#29305;&#23450;&#21151;&#33021;&#30340;&#23553;&#35013;</h3></div></div></div><p>&#20026;&#23454;&#29616;&#29305;&#23450;&#21151;&#33021;&#65292;&#25552;&#20379;&#19968;&#31995;&#21015;&#22522;&#31867;&#19982;&#24110;&#21161;&#31867;&#12290;</p><div class="orderedlist"><ol type="1"><li><p>NamedManager&#29992;&#20110;&#22788;&#29702;&#25968;&#25454;&#23383;&#20856;&#65292;&#25552;&#20379;createOrGet()&#26041;&#27861;&#65292;&#23454;&#29616;&#21151;&#33021;&#20026;&#20808;&#22312;&#25968;&#25454;&#24211;&#26597;&#25214;&#21516;&#21517;&#35760;&#24405;&#65292;&#22914;&#26524;&#23384;&#22312;&#21017;&#36820;&#22238;&#36825;&#26465;&#35760;&#24405;&#65292;&#22914;&#26524;&#35760;&#24405;&#19981;&#23384;&#22312;&#65292;&#21017;&#23558;&#21517;&#31216;&#20445;&#23384;&#36827;&#25968;&#25454;&#24211;&#65292;&#24182;&#36820;&#22238;&#20445;&#23384;&#35760;&#24405;&#23545;&#24212;&#30340;&#23545;&#35937;&#12290;</p></li><li><p>TreeManager&#29992;&#25143;&#22788;&#29702;&#33258;&#20851;&#32852;&#26641;&#24418;&#32467;&#26500;&#65292;&#22914;&#33756;&#21333;&#65292;&#32452;&#32455;&#32467;&#26500;&#65292;&#25552;&#20379;getTops()&#26041;&#27861;&#65292;&#33719;&#24471;&#39030;&#32423;&#33410;&#28857;&#30340;&#38598;&#21512;&#12290;</p><p>TreeHelper&#25552;&#20379;&#26816;&#27979;parent&#19982;child&#20043;&#38388;&#26159;&#21542;&#23384;&#22312;&#24490;&#29615;&#20851;&#32852;&#30340;checkDeadLock()&#26041;&#27861;&#12290;</p><p>&#36827;&#19968;&#27493;&#21040;&#36798;&#34920;&#31034;&#23618;&#65292;&#20351;&#29992;extjs&#23553;&#35013;&#30340;&#26641;&#24418;&#25511;&#20214;&#65292;&#23569;&#37327;&#20195;&#30721;&#21363;&#21487;&#23454;&#29616;&#26641;&#24418;&#30340;&#24120;&#29992;&#21151;&#33021;&#12290;</p></li></ol></div></div><p>&#38500;&#20102;&#19978;&#36848;&#26368;&#22522;&#26412;&#30340;&#26550;&#26500;&#65292;&#25105;&#20204;&#36824;&#38656;&#35201;&#32467;&#21512;Jbpm&#24037;&#20316;&#27969;&#65292;Drools&#35268;&#21017;&#24341;&#25806;&#65292;JasperReport&#25253;&#34920;&#24341;&#25806;&#65292;Compass/Lucene&#25628;&#32034;&#24341;&#25806;&#65292;CXF WebService&#65292;ActiveMQ JMS&#65292;OSGI&#25554;&#20214;&#26550;&#26500;&#65292;&#24182;&#22312;&#23454;&#20363;&#20013;&#19968;&#19968;&#28436;&#31034;&#12290;</p></div><div class="sect1" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d4e97"></a>1.3.&nbsp;&#20026;&#21861;&#19981;&#29992;&#20854;&#20182;&#26550;&#26500;</h2></div></div></div><p>&#35752;&#35770;&#19968;&#19979;&#20351;&#29992;&#20854;&#20182;&#26550;&#26500;&#30340;&#21487;&#33021;&#65292;&#27604;&#36739;&#19968;&#19979;&#19982;&#25105;&#20204;&#36873;&#29992;&#26550;&#26500;&#30340;&#20248;&#32570;&#28857;&#65292;&#24076;&#26395;&#22823;&#23478;&#21487;&#20197;&#26681;&#25454;&#33258;&#24049;&#30340;&#24773;&#20917;&#36873;&#25321;&#36866;&#21512;&#33258;&#24049;&#30340;&#26041;&#24335;&#12290;</p><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e100"></a>1.3.1.&nbsp;&#20026;&#21861;&#19981;&#29992;&#20256;&#32479;&#30340;&#20116;&#23618;DAO&#24418;&#24335;</h3></div></div></div><p>&#20256;&#32479;&#24773;&#20917;&#26159;Manager Interface : Manager Implement : DAO Interface : DAO Implement : POJO&#12290;&#32780;&#25105;&#20204;&#37319;&#29992;&#30340;&#26159;Manager Impl + POJO&#20004;&#23618;&#25630;&#23450;&#12290;&#20256;&#32479;&#24418;&#24335;&#25454;&#35828;&#26159;&#26368;&#22823;&#38480;&#24230;&#30340;&#39038;&#21450;&#21040;&#35774;&#35745;&#19982;&#23454;&#29616;&#30340;&#28789;&#27963;&#31243;&#24230;&#65292;&#23558;&#26368;&#22522;&#26412;&#30340;&#25805;&#20316;&#37117;&#25918;&#21040;DAO&#23618;&#65292;Manager&#23618;&#20013;&#21487;&#20197;&#38598;&#21512;&#22810;&#20010;DAO&#36827;&#34892;&#22797;&#26434;&#19994;&#21153;&#25805;&#20316;&#65292;&#32780;&#27599;&#19968;&#23618;&#20043;&#38388;&#30340;&#25509;&#21475;&#21487;&#20197;&#20445;&#35777;&#20998;&#23618;&#20043;&#38388;&#23545;&#23454;&#29616;&#36827;&#34892;&#38543;&#24847;&#26356;&#25442;&#12290;</p><p>&#25105;&#20204;&#35752;&#35770;&#30340;&#23545;&#35937;&#26356;&#22810;&#38754;&#21521;&#20110;&#20013;&#23567;&#22411;&#39033;&#30446;&#65292;&#36825;&#26679;&#23601;&#24456;&#21487;&#33021;&#32570;&#20047;&#35814;&#23613;&#30340;&#35774;&#35745;&#21644;&#19994;&#21153;&#20998;&#26512;&#65292;&#24320;&#21457;&#20013;&#26356;&#20542;&#21521;&#20110;&#23454;&#29992;&#19982;&#24555;&#25463;&#12290;</p><p>&#39318;&#20808;&#26159;DAO&#23618;&#34987;&#25105;&#20204;&#21435;&#25481;&#20102;&#65292;&#22240;&#20026;Hibernate&#22522;&#26412;&#31561;&#20110;&#23454;&#29616;&#20102;DAO&#20013;&#30340;&#22522;&#26412;&#25805;&#20316;&#65292;&#21487;&#20197;&#35828;&#26377;&#20102;Hibernate&#23601;&#19981;&#38656;&#35201;&#20351;&#29992;DAO&#20102;&#12290;&#20854;&#27425;&#26159;&#25509;&#21475;&#34987;&#25105;&#20204;&#30465;&#30053;&#20102;&#65292;&#22240;&#20026;&#22312;&#23454;&#38469;&#24320;&#21457;&#36807;&#31243;&#20013;&#24456;&#23569;&#20986;&#29616;&#22810;&#31181;&#23454;&#29616;&#30340;&#24773;&#20917;&#65292;&#32463;&#24120;&#26159;&#24320;&#21457;&#19968;&#22871;&#23454;&#29616;&#37117;&#23244;&#26102;&#38388;&#19981;&#22815;&#65292;&#21738;&#20799;&#26377;&#26102;&#38388;&#21435;&#39044;&#22791;&#22810;&#22871;&#23454;&#29616;&#21602;&#65311;&#36825;&#31181;&#24773;&#20917;&#19979;&#25509;&#21475;&#23436;&#20840;&#26159;&#19968;&#20010;&#32047;&#36184;&#65292;&#25152;&#35859;&#20026;&#20102;&#26356;&#24555;&#30340;&#24320;&#21457;&#65292;&#26356;&#24555;&#30340;&#20462;&#25913;&#65292;&#25105;&#20204;&#27809;&#24517;&#35201;&#22312;&#20808;&#34892;&#35774;&#35745;&#26102;&#21152;&#19978;&#36825;&#20040;&#19968;&#23618;&#12290;</p><p>&#23454;&#38469;&#19978;&#25105;&#20204;&#21482;&#26159;&#22312;&#20808;&#34892;&#35774;&#35745;&#26102;&#30465;&#30053;&#20102;&#19981;&#24120;&#29992;&#30340;DAO&#21644;&#25509;&#21475;&#65292;&#19968;&#26086;&#36935;&#21040;&#22797;&#26434;&#30340;&#19994;&#21153;&#24773;&#20917;&#65292;&#25105;&#20204;&#38543;&#26102;&#37117;&#21487;&#20197;&#25286;&#20998;Manager&#23618;&#65292;&#25277;&#31163;&#20986;DAO&#23618;&#25110;&#32773;&#25509;&#21475;&#23618;&#12290;&#36825;&#26679;&#25105;&#20204;&#22312;&#20445;&#25345;&#24555;&#36895;&#24320;&#21457;&#30340;&#36807;&#31243;&#20013;&#20063;&#21487;&#20197;&#39038;&#21450;&#21040;&#25193;&#23637;&#24615;&#12290;</p></div><div class="sect2" lang="zh-cn"><div class="titlepage"><div><div><h3 class="title"><a name="d4e106"></a>1.3.2.&nbsp;&#20026;&#21861;&#19981;&#30452;&#25509;&#20351;&#29992;Spring-Test</h3></div></div></div><p>&#25105;&#20204;&#37319;&#29992;mock&#20223;&#36896;&#25152;&#26377;&#20381;&#36182;&#36827;&#34892;&#21333;&#20803;&#27979;&#35797;&#65292;&#36825;&#26679;&#20570;&#30340;&#22909;&#22788;&#26159;&#36895;&#24230;&#24555;&#65292;&#19968;&#20999;&#30340;&#20381;&#36182;&#37117;&#26159;&#33258;&#24049;mock&#20223;&#36896;&#20986;&#26469;&#30340;&#65292;&#24320;&#21457;&#32773;&#26356;&#23481;&#26131;&#23454;&#29616;&#27979;&#35797;&#30340;&#21508;&#31181;&#24773;&#20917;&#12290;&#20351;&#29992;mock&#30340;&#22351;&#22788;&#26159;&#27809;&#26377;&#22312;&#30495;&#23454;&#29615;&#22659;&#36827;&#34892;&#27979;&#35797;&#65292;&#20223;&#36896;&#30340;&#29615;&#22659;&#24456;&#21487;&#33021;&#26377;&#29781;&#30133;&#65292;&#36825;&#26679;&#27979;&#35797;&#36890;&#36807;&#20102;&#23454;&#38469;&#20013;&#20063;&#21487;&#33021;&#20986;&#29616;&#38382;&#39064;&#12290;&#36824;&#26377;&#23601;&#26159;&#22312;&#27979;&#35797;Hibernate&#36825;&#31181;&#31649;&#29702;&#23618;&#26102;&#65292;&#38656;&#35201;&#20223;&#36896;&#30340;&#26465;&#20214;&#22826;&#22797;&#26434;&#65292;&#35753;&#20154;&#19981;&#22570;&#37325;&#36127;&#12290;</p><p>&#19982;&#27492;&#23545;&#24212;&#30340;&#19968;&#31181;&#26041;&#27861;&#26159;&#22312;&#21333;&#20803;&#27979;&#35797;&#26102;&#65292;&#30452;&#25509;&#21152;&#36733;&#25152;&#26377;&#37197;&#32622;&#25991;&#20214;&#65292;&#25171;&#36896;&#19968;&#20010;&#19982;&#30495;&#23454;&#36816;&#34892;&#29615;&#22659;&#19968;&#26679;&#30340;&#27979;&#35797;&#29615;&#22659;&#36827;&#34892;&#27979;&#35797;&#65292;&#36825;&#26679;&#30340;&#22909;&#22788;&#26159;&#30465;&#21435;&#20102;&#27599;&#27425;mock&#20381;&#36182;&#26465;&#20214;&#30340;&#40635;&#28902;&#65292;&#20294;&#26159;&#38382;&#39064;&#26159;&#36895;&#24230;&#24930;&#20102;&#65292;&#21363;&#20351;&#20351;&#29992;Spring-Test&#32531;&#23384;&#37197;&#32622;&#25991;&#20214;&#65292;&#36825;&#26679;&#30340;&#27979;&#35797;&#36895;&#24230;&#20063;&#36824;&#26159;&#24930;&#20102;&#24456;&#22810;&#12290;</p><p>&#25105;&#20204;&#19981;&#20351;&#29992;Spring-Test&#36827;&#34892;&#21333;&#20803;&#27979;&#35797;&#30340;&#26368;&#20027;&#35201;&#21407;&#22240;&#26159;&#65292;&#21333;&#20803;&#27979;&#35797;&#24212;&#35813;&#19981;&#21463;&#22806;&#37096;&#29615;&#22659;&#24178;&#25200;&#65292;&#22914;&#26524;&#20687;&#36825;&#26679;&#21152;&#36733;&#25152;&#26377;&#37197;&#32622;&#25991;&#20214;&#65292;&#22914;&#26524;&#26159;&#22240;&#20026;&#21035;&#20154;&#20889;&#30340;&#20195;&#30721;&#36896;&#25104;&#33258;&#24049;&#30340;&#21333;&#20803;&#27979;&#35797;&#22833;&#36133;&#65292;&#23454;&#38469;&#24037;&#20316;&#20013;&#23601;&#20250;&#20986;&#29616;&#25512;&#21368;&#36131;&#20219;&#30340;&#38382;&#39064;&#20102;&#12290;&#22240;&#20026;&#25105;&#20204;&#36824;&#26159;&#24076;&#26395;&#20808;&#20351;&#29992;mock&#20223;&#36896;&#25152;&#26377;&#29615;&#22659;&#65292;&#20445;&#35777;&#26412;&#36523;&#20195;&#30721;&#23454;&#29616;&#27809;&#26377;&#38382;&#39064;&#65292;&#32780;&#19988;&#21333;&#20803;&#27979;&#35797;&#20063;&#24212;&#35813;&#22312;&#26368;&#30701;&#30340;&#26102;&#38388;&#20869;&#36816;&#34892;&#23436;&#12290;</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preface.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="technique.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24207;&#35328;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#25216;&#26415;&#36873;&#22411;</td></tr></table></div></body></html>