<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;&nbsp;1&nbsp;&#31456;&nbsp;OA&#30340;&#27010;&#24565;</title><link rel="stylesheet" href="css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.73.2"><style type="text/css">
body { background-image: url('images/draft.png');
       background-repeat: no-repeat;
       background-position: top left;
       /* The following properties make the watermark "fixed" on the page. */
       /* I think that's just a bit too distracting for the reader... */
       /* background-attachment: fixed; */
       /* background-position: center center; */
     }</style><link rel="start" href="index.html" title="Leona"><link rel="up" href="index.html" title="Leona"><link rel="prev" href="preface.html" title="&#24207;&#35328;"><link rel="next" href="roadmap.html" title="&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#36828;&#26223;&#35268;&#21010;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns="http://www.w3.org/TR/xhtml1/transitional" xmlns:fo="http://www.w3.org/1999/XSL/Format" style="background-color:white;border:none;height:73px;border:1px solid black;"><a style="border:none;" href="http://www.family168.com/" title="Family168"><img src="images/family168.png" border="0"></img></a></div><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;&nbsp;1&nbsp;&#31456;&nbsp;OA&#30340;&#27010;&#24565;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preface.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="roadmap.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="chapter" lang="zh-cn"><div class="titlepage"><div><div><h2 class="title"><a name="definition"></a>&#31532;&nbsp;1&nbsp;&#31456;&nbsp;OA&#30340;&#27010;&#24565;</h2></div></div></div><p>&#21150;&#20844;&#33258;&#21160;&#21270;Office Automation&#65292;&#23601;&#26159;&#37319;&#29992;Internet/Intranet&#25216;&#26415;&#65292;&#22522;&#20110;&#24037;&#20316;&#27969;&#30340;&#27010;&#24565;&#65292;&#20351;&#20225;&#19994;&#20869;&#37096;&#20154;&#21592;&#26041;&#20415;&#24555;&#25463;&#22320;&#20849;&#20139;&#20449;&#24687;&#65292;&#39640;&#25928;&#22320;&#21327;&#21516;&#24037;&#20316;&#65292;&#25913;&#21464;&#36807;&#21435;&#22797;&#26434;&#12289;&#20302;&#25928;&#30340;&#25163;&#24037;&#21150;&#20844;&#26041;&#24335;&#65292;&#23454;&#29616;&#36805;&#36895;&#12289;&#20840;&#26041;&#20301;&#30340;&#20449;&#24687;&#37319;&#38598;&#12289;&#20449;&#24687;&#22788;&#29702;&#65292;&#20026;&#20225;&#19994;&#30340;&#31649;&#29702;&#21644;&#20915;&#31574;&#25552;&#20379;&#31185;&#23398;&#30340;&#19968;&#21477;&#12290;&#19968;&#20010;&#20225;&#19994;&#23454;&#29616;&#21150;&#20844;&#33258;&#21160;&#21270;&#30340;&#31243;&#24230;&#20063;&#26159;&#34913;&#37327;&#20854;&#23454;&#29616;&#29616;&#20195;&#21270;&#20449;&#24687;&#31649;&#29702;&#30340;&#26631;&#20934;&#12290;</p><p>&#34429;&#28982;&#35832;&#22914;Lotus 1-2-3&#25110;MS Office&#31995;&#21015;&#30340;&#35768;&#22810;&#24212;&#29992;&#36719;&#20214;&#21487;&#20197;&#25552;&#39640;&#21150;&#20844;&#25928;&#29575;&#65292;&#20294;&#26159;&#36825;&#20165;&#20165;&#26159;&#38024;&#23545;&#20010;&#20154;&#21150;&#20844;&#32780;&#35328;&#12290;&#21150;&#20844;&#33258;&#21160;&#21270;&#19981;&#20165;&#20860;&#39038;&#20010;&#20154;&#21150;&#20844;&#25928;&#29575;&#30340;&#25552;&#39640;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#21487;&#20197;&#23454;&#29616;&#32676;&#20307;&#21327;&#21516;&#24037;&#20316;&#12290;&#21327;&#21516;&#24037;&#20316;&#24847;&#21619;&#30528;&#35201;&#36827;&#34892;&#20449;&#24687;&#30340;&#20132;&#27969;&#65292;&#24037;&#20316;&#30340;&#21327;&#35843;&#19982;&#21512;&#20316;&#12290;&#30001;&#20110;&#32593;&#32476;&#30340;&#23384;&#22312;&#65292;&#36825;&#31181;&#20132;&#27969;&#19982;&#21327;&#35843;&#20960;&#20046;&#21487;&#20197;&#22312;&#30636;&#38388;&#23436;&#25104;&#65292;&#24182;&#19988;&#19981;&#24517;&#25285;&#24515;&#23545;&#26041;&#26159;&#21542;&#22312;&#30005;&#35805;&#26426;&#26049;&#36793;&#25110;&#26159;&#21542;&#26377;&#20256;&#30495;&#26426;&#21487;&#29992;&#12290;&#36825;&#37324;&#25152;&#35828;&#30340;&#32676;&#20307;&#24037;&#20316;&#65292;&#21487;&#20197;&#21253;&#25324;&#22312;&#22320;&#29702;&#19978;&#20998;&#24067;&#24456;&#24191;&#65292;&#29978;&#33267;&#20998;&#24067;&#22312;&#20840;&#29699;&#21508;&#20010;&#22320;&#26041;&#65292;&#29978;&#33267;&#24037;&#20316;&#26102;&#38388;&#37117;&#19981;&#30456;&#21516;&#30340;&#24037;&#20316;&#20154;&#21592;&#12290;</p><p>&#21150;&#20844;&#33258;&#21160;&#21270;&#21487;&#20197;&#21644;&#19968;&#20010;&#20225;&#19994;&#30340;&#19994;&#21153;&#32467;&#21512;&#30340;&#38750;&#24120;&#32039;&#23494;&#65292;&#29978;&#33267;&#26159;&#23450;&#21046;&#30340;&#12290;&#22240;&#32780;&#21487;&#20197;&#23558;&#35832;&#22914;&#20449;&#24687;&#37319;&#38598;&#12289;&#26597;&#35810;&#12289;&#32479;&#35745;&#31561;&#21151;&#33021;&#19982;&#20855;&#20307;&#19994;&#21153;&#23494;&#20999;&#20851;&#32852;&#12290;&#25805;&#20316;&#20154;&#21592;&#21482;&#39035;&#28857;&#20987;&#19968;&#20010;&#25353;&#38062;&#23601;&#21487;&#20197;&#24471;&#21040;&#24819;&#35201;&#30340;&#32467;&#26524;&#65292;&#20174;&#32780;&#26497;&#22823;&#30340;&#26041;&#20415;&#20102;&#20225;&#19994;&#39046;&#23548;&#30340;&#31649;&#29702;&#21644;&#20915;&#31574;&#12290;</p><p>&#21150;&#20844;&#33258;&#21160;&#21270;&#36824;&#26159;&#19968;&#20010;&#20225;&#19994;&#19982;&#25972;&#20010;&#19990;&#30028;&#32852;&#31995;&#30340;&#28192;&#36947;&#65292;&#20225;&#19994;&#30340;Intranet&#32593;&#32476;&#21487;&#20197;&#21644;Internet&#30456;&#36830;&#12290;&#19968;&#26041;&#38754;&#65292;&#20225;&#19994;&#30340;&#21592;&#24037;&#21487;&#20197;&#20877;Internet&#19978;&#26597;&#25214;&#26377;&#20851;&#30340;&#25216;&#26415;&#36164;&#26009;&#12289;&#24066;&#22330;&#34892;&#24773;&#65292;&#19982;&#29616;&#26377;&#25110;&#28508;&#22312;&#30340;&#23458;&#25143;&#12289;&#21512;&#20316;&#20249;&#20276;&#32852;&#31995;&#65292;&#21478;&#19968;&#26041;&#38754;&#65292;&#20854;&#20182;&#20225;&#19994;&#21487;&#20197;&#36890;&#36807;Internet&#35775;&#38382;&#26412;&#20844;&#21496;&#23545;&#22806;&#21457;&#24067;&#30340;&#20225;&#19994;&#20449;&#24687;&#65292;&#22914;&#20225;&#19994;&#20171;&#32461;&#12289;&#29983;&#20135;&#32463;&#33829;&#19994;&#32489;&#12289;&#19994;&#21153;&#33539;&#22260;&#12289;&#20135;&#21697;&#26381;&#21153;&#31561;&#20449;&#24687;&#12290;&#20174;&#32780;&#36215;&#21040;&#23459;&#20256;&#20844;&#21496;&#30340;&#20316;&#29992;&#12290;&#38543;&#30528;&#21150;&#20844;&#33258;&#21160;&#21270;&#30340;&#25512;&#24191;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;&#20225;&#19994;&#23558;&#36890;&#36807;&#33258;&#24049;&#30340;Intranet&#32593;&#32476;&#36830;&#25509;&#21040;Internet&#19978;&#65292;&#36825;&#31181;&#32593;&#19978;&#20132;&#27969;&#30340;&#28508;&#21147;&#23558;&#26159;&#38750;&#24120;&#24040;&#22823;&#30340;&#12290;</p><p>&#30446;&#21069;&#20225;&#19994;&#30340;&#21150;&#20844;&#33258;&#21160;&#21270;&#31243;&#24230;&#21487;&#20197;&#21010;&#20998;&#20026;&#19968;&#19979;&#22235;&#31867;&#65306;</p><div class="orderedlist"><ol type="1"><li><p>&#36215;&#27493;&#24930;&#65292;&#36824;&#20572;&#30041;&#22312;&#20351;&#29992;&#27809;&#26377;&#32852;&#32593;&#30340;&#35745;&#31639;&#26426;&#65292;&#20351;&#29992;MS Office&#31995;&#21015;&#24212;&#29992;&#36719;&#20214;&#20197;&#25552;&#39640;&#20010;&#20154;&#21150;&#20844;&#25928;&#29575;&#12290;</p></li><li><p>&#24050;&#32463;&#24314;&#31435;&#20102;&#33258;&#24049;&#30340;Intranet&#32593;&#32476;&#65292;&#20294;&#27809;&#26377;&#22909;&#30340;&#24212;&#29992;&#31995;&#32479;&#25903;&#25345;&#21327;&#21516;&#24037;&#20316;&#65292;&#20173;&#28982;&#26159;&#20010;&#20154;&#21150;&#20844;&#12290;&#32593;&#32476;&#22788;&#20110;&#38386;&#32622;&#29366;&#24577;&#65292;&#20225;&#19994;&#30340;&#25237;&#36164;&#27809;&#26377;&#20135;&#29983;&#24212;&#26377;&#30340;&#25928;&#30410;&#12290;</p></li><li><p>&#24050;&#32463;&#24314;&#31435;&#20102;&#33258;&#24049;&#30340;Intranet&#32593;&#32476;&#65292;&#20225;&#19994;&#20869;&#37096;&#21592;&#24037;&#36890;&#36807;&#30005;&#23376;&#37038;&#20214;&#20132;&#27969;&#20449;&#24687;&#65292;&#23454;&#29616;&#20102;&#26377;&#38480;&#30340;&#21327;&#21516;&#24037;&#20316;&#65292;&#20294;&#20135;&#29983;&#30340;&#25928;&#30410;&#19981;&#26126;&#26174;&#12290;</p></li><li><p>&#24050;&#32463;&#24314;&#31435;&#20102;&#33258;&#24049;&#30340;Intranet&#32593;&#32476;&#65292;&#20351;&#29992;&#32463;&#20108;&#27425;&#24320;&#21457;&#30340;&#36890;&#29992;&#21150;&#20844;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#33021;&#36739;&#22909;&#30340;&#25903;&#25345;&#20449;&#24687;&#20849;&#20139;&#21644;&#21327;&#21516;&#24037;&#20316;&#65292;&#19982;&#22806;&#30028;&#32852;&#31995;&#30340;&#20449;&#24687;&#28192;&#36947;&#30021;&#36890;&#65292;&#36890;&#36807;Internet&#21457;&#24067;&#12289;&#23459;&#20256;&#20225;&#19994;&#30340;&#20135;&#21697;&#12289;&#25216;&#26415;&#12289;&#26381;&#21153;&#65292;Intranet&#32593;&#32476;&#24050;&#32463;&#23545;&#20225;&#19994;&#30340;&#32463;&#33829;&#20135;&#29983;&#20102;&#31215;&#26497;&#22320;&#25928;&#30410;&#12290;&#29616;&#22312;&#27491;&#30528;&#25163;&#24320;&#21457;&#25110;&#24050;&#32463;&#22312;&#20351;&#29992;&#38024;&#23545;&#19994;&#21153;&#23450;&#21046;&#30340;&#32508;&#21512;&#21150;&#20844;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#23454;&#29616;&#31185;&#23398;&#30340;&#31649;&#29702;&#21644;&#20915;&#31574;&#65292;&#22686;&#24378;&#20225;&#19994;&#30340;&#31454;&#20105;&#33021;&#21147;&#65292;&#20351;&#20225;&#19994;&#19981;&#26029;&#21457;&#23637;&#22766;&#22823;&#12290;</p></li></ol></div><p>&#21150;&#20844;&#33258;&#21160;&#21270;&#24050;&#32463;&#25104;&#20026;&#20225;&#19994;&#30028;&#30340;&#20849;&#35782;&#12290;&#20247;&#22810;&#20225;&#19994;&#35748;&#35782;&#21040;&#23613;&#24555;&#36827;&#34892;&#20225;&#19994;&#33258;&#21160;&#21270;&#24314;&#35774;&#65292;&#24182;&#21344;&#25454;&#39046;&#20808;&#22320;&#20301;&#65292;&#23558;&#26377;&#21161;&#20110;&#20445;&#25345;&#31454;&#20105;&#20248;&#21183;&#65292;&#20351;&#20225;&#19994;&#30340;&#21457;&#23637;&#24418;&#25104;&#33391;&#24615;&#24490;&#29615;&#12290;</p><p>&#21150;&#20844;&#33258;&#21160;&#21270;&#30340;&#23454;&#26045;&#24212;&#35813;&#32771;&#34385;&#20225;&#19994;&#30340;&#23454;&#38469;&#24773;&#20917;&#65292;&#20027;&#35201;&#26159;&#20225;&#19994;&#30340;&#32463;&#27982;&#23454;&#21147;&#12290;&#25353;&#29031;&#19978;&#36848;&#20998;&#26512;&#65292;&#31532;&#19968;&#31867;&#20225;&#19994;&#36827;&#34892;&#20225;&#19994;&#33258;&#21160;&#21270;&#33392;&#28073;&#23601;&#38656;&#35201;&#36739;&#22810;&#25237;&#20837;&#65292;&#26082;&#35201;&#25645;&#24314;&#20225;&#19994;Intranet&#32593;&#32476;&#65292;&#21448;&#35201;&#24320;&#21457;&#20225;&#19994;&#21150;&#20844;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#38656;&#35201;&#20225;&#19994;&#26377;&#36739;&#24378;&#30340;&#32463;&#27982;&#23454;&#21147;&#25165;&#33021;&#23436;&#25104;&#65292;&#32780;&#23545;&#20110;&#31532;&#20108;&#12289;&#31532;&#19977;&#31867;&#20225;&#19994;&#65292;&#30001;&#20110;&#20225;&#19994;Intranet&#32593;&#32476;&#24050;&#32463;&#23384;&#22312;&#65292;&#21482;&#26159;&#27809;&#26377;&#25110;&#27809;&#26377;&#22909;&#30340;&#21150;&#20844;&#24212;&#29992;&#31995;&#32479;&#65292;&#25152;&#20197;&#21482;&#38656;&#25237;&#20837;&#30456;&#23545;&#32593;&#32476;&#25237;&#36164;&#23569;&#24471;&#22810;&#30340;&#36164;&#37329;&#21363;&#21487;&#24320;&#21457;&#36890;&#29992;&#21150;&#20844;&#33258;&#21160;&#21270;&#31995;&#32479;&#65292;&#20135;&#29983;&#36739;&#39640;&#30340;&#25237;&#36164;&#22238;&#25253;&#12290;&#21363;&#20415;&#19968;&#27493;&#21040;&#20301;&#24320;&#21457;&#32508;&#21512;&#21150;&#20844;&#33258;&#21160;&#21270;&#31995;&#32479;&#20854;&#25237;&#36164;&#20063;&#35201;&#27604;&#32593;&#32476;&#25237;&#36164;&#23569;&#24471;&#22810;&#65292;&#32780;&#20135;&#29983;&#30340;&#32463;&#27982;&#25928;&#30410;&#26356;&#39640;&#65292;&#23545;&#20110;&#31532;&#22235;&#31867;&#20225;&#19994;&#65292;&#30001;&#20110;&#20854;&#21150;&#20844;&#33258;&#21160;&#21270;&#22522;&#30784;&#22909;&#65292;&#21482;&#39035;&#36739;&#23569;&#30340;&#25237;&#36164;&#21363;&#21487;&#36798;&#21040;&#30446;&#21069;&#21150;&#20844;&#33258;&#21160;&#21270;&#30340;&#26368;&#39640;&#27700;&#24179;&#12290;</p><p>&#37027;&#20040;&#65292;&#20160;&#20040;&#26679;&#30340;&#20225;&#19994;&#36866;&#21512;&#20351;&#29992;&#21150;&#20844;&#33258;&#21160;&#21270;&#31995;&#32479;&#21602;&#65311;&#20960;&#20046;&#25152;&#26377;&#20225;&#19994;&#37117;&#36866;&#21512;&#20351;&#29992;&#21150;&#20844;&#33258;&#21160;&#21270;(OA)&#31995;&#32479;&#65292;&#20294;&#19981;&#21516;&#20225;&#19994;&#20351;&#29992;&#30340;&#30446;&#30340;&#24615;&#20250;&#26377;&#25152;&#19981;&#21516;&#65292;&#20855;&#20307;&#26159;&#65306;</p><div class="orderedlist"><ol type="1"><li><p>&#20449;&#24687;&#21270;&#23578;&#26410;&#20837;&#38376;&#30340;&#20225;&#19994;</p><p>&#30001;&#20110;&#27809;&#26377;&#20449;&#24687;&#21270;&#24212;&#29992;&#22522;&#30784;&#65292;&#29575;&#20808;&#23454;&#26045;&#21150;&#20844;&#33258;&#21160;&#21270;(OA)&#65292;&#26377;&#30528;&#36817;&#20046;100%&#30340;&#25104;&#21151;&#29575;&#65292;&#26377;&#21033;&#20110;&#25552;&#39640;&#20225;&#19994;&#21508;&#32423;&#20154;&#21592;&#30340;&#22522;&#26412;&#32032;&#36136;&#19982;&#35745;&#31639;&#26426;&#26041;&#38754;&#30340;&#23454;&#38469;&#25805;&#20316;&#33021;&#21147;&#65292;&#26377;&#21033;&#20110;&#20170;&#21518;&#19994;&#21153;&#39046;&#22495;&#20225;&#19994;&#20449;&#24687;&#21270;&#24037;&#20316;&#30340;&#24320;&#23637;&#12290;</p></li><li><p>&#20449;&#24687;&#21270;&#22833;&#36133;&#25110;&#20005;&#37325;&#32570;&#20047;&#20449;&#24687;&#21270;&#24037;&#20316;&#20449;&#24687;&#30340;&#20225;&#19994;</p><p>&#20449;&#24687;&#21270;&#22833;&#36133;&#65292;&#29305;&#21035;&#26159;&#22823;&#22411;&#19994;&#21153;&#31649;&#29702;&#31995;&#32479;&#22833;&#36133;&#65292;&#20363;&#22914;ERP&#65292;&#32473;&#20225;&#19994;&#26041;&#38754;&#30340;&#20449;&#24687;&#25171;&#20987;&#26159;&#21313;&#20998;&#27785;&#37325;&#30340;&#65292;&#20026;&#20102;&#37325;&#22609;&#20449;&#24687;&#27963;&#30528;&#19968;&#24320;&#22987;&#23601;&#22238;&#36991;&#39118;&#38505;&#65292;&#36873;&#25321;&#21150;&#20844;&#33258;&#21160;&#21270;&#19981;&#22833;&#20026;&#19968;&#31181;&#36873;&#25321;&#12290;</p></li><li><p>&#32570;&#23569;&#20449;&#24687;&#21270;&#36164;&#37329;&#20934;&#22791;&#30340;&#20225;&#19994;</p><p>&#20449;&#24687;&#21270;&#25237;&#20837;&#19968;&#33324;&#27604;&#36739;&#26114;&#36149;&#65292;&#22312;&#27809;&#26377;&#35265;&#21040;&#23454;&#38469;&#25928;&#26524;&#30340;&#26102;&#20505;&#65292;&#22810;&#25968;&#20225;&#19994;&#20250;&#29369;&#35947;&#19981;&#20915;&#12290;&#22240;&#27492;&#65292;&#23545;&#20110;&#35880;&#24910;&#22411;&#30340;&#20225;&#19994;&#27963;&#30528;&#36164;&#37329;&#19981;&#20805;&#35029;&#30340;&#20225;&#19994;&#65292;&#20808;&#19978;&#21150;&#20844;&#33258;&#21160;&#21270; &#65288;OA&#65289;&#65292;&#26377;&#21033;&#20110;&#20225;&#19994;&#36880;&#27493;&#20102;&#35299;&#20225;&#19994;&#20449;&#24687;&#21270;&#21450;&#20854;&#20316;&#29992;&#65292;&#20943;&#23569;&#20170;&#21518;&#20449;&#24687;&#21270;&#24037;&#20316;&#22320;&#30450;&#30446;&#24615;&#12290;</p></li><li><p>&#24050;&#25317;&#26377;&#19994;&#21153;&#31649;&#29702;&#31995;&#32479;&#19988;&#38656;&#35201;&#36827;&#19968;&#27493;&#25913;&#21892;&#34892;&#25919;&#21150;&#20844;&#19982;&#20869;&#37096;&#20449;&#24687;&#20132;&#27969;&#29615;&#22659;&#30340;&#20225;&#19994;</p><p>&#21150;&#20844;&#33258;&#21160;&#21270;(OA)&#19982;&#19994;&#21153;&#31649;&#29702;&#31995;&#32479;&#20114;&#20026;&#34917;&#20805;&#65292;&#21487;&#20197;&#20016;&#23500;&#24182;&#23436;&#21892;&#20225;&#19994;&#20449;&#24687;&#21270;&#24037;&#20316;&#30340;&#24418;&#24335;&#19982;&#20869;&#23481;&#12290;</p></li></ol></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preface.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="roadmap.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td width="40%" align="left" valign="top">&#24207;&#35328;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;&nbsp;2&nbsp;&#31456;&nbsp;&#36828;&#26223;&#35268;&#21010;</td></tr></table></div></body></html>